# RebarEmptySketchError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..RebarEmptySketchError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Rebar Sketch is empty. Can't create Rebar.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarEmptySketchError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarEmptySketchError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarEmptySketchError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace